boards-test-artillery.yml
config:
  target: "http://localhost:4000"
  phases:
    - duration: 10
      arrivalRate: 10
      rampTo: 30
      name: "Warm up"
scenarios:
  - name: "Boards test"
    flow:
      - get:
          url: '/boards'
          headers:
            authorization: 'Bearer eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpZCI6IjY5YjdlYTNmLTg2MWYtNGJhOC04MTUzLTIzMTRjZmVmMTY5NiIsImxvZ2luIjoiYWRtaW4iLCJpYXQiOjE2MjYwMDgyMTJ9.lugx_4bjwAfHDjFFvnzMZaOl95qPLHGBEtzEx3vd0I4'
      - posr:
          url: '/boards'
          headers:
            authorization: 'Bearer eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpZCI6IjY5YjdlYTNmLTg2MWYtNGJhOC04MTUzLTIzMTRjZmVmMTY5NiIsImxvZ2luIjoiYWRtaW4iLCJpYXQiOjE2MjYwMDgyMTJ9.lugx_4bjwAfHDjFFvnzMZaOl95qPLHGBEtzEx3vd0I4'
          json:
            title: 'Autotest board'
            columns: [
              { title: 'Backlog', order: 1 },
              { title: 'Sprint', order: 2 }
              ]
          capture:
            -json: '$.id'
            -as: 'id'
      - get:
          url: '/boards/{{id}}'
          headers:
            authorization: 'Bearer eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpZCI6IjY5YjdlYTNmLTg2MWYtNGJhOC04MTUzLTIzMTRjZmVmMTY5NiIsImxvZ2luIjoiYWRtaW4iLCJpYXQiOjE2MjYwMDgyMTJ9.lugx_4bjwAfHDjFFvnzMZaOl95qPLHGBEtzEx3vd0I4'
      - put:
          url: '/boards/{{id}}'
          headers:
            authorization: 'Bearer eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpZCI6IjY5YjdlYTNmLTg2MWYtNGJhOC04MTUzLTIzMTRjZmVmMTY5NiIsImxvZ2luIjoiYWRtaW4iLCJpYXQiOjE2MjYwMDgyMTJ9.lugx_4bjwAfHDjFFvnzMZaOl95qPLHGBEtzEx3vd0I4'
          json:
            title: 'updated board'  
      - delete:
          url: '/boards/{{id}}'
          headers:
            authorization: 'Bearer eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpZCI6IjY5YjdlYTNmLTg2MWYtNGJhOC04MTUzLTIzMTRjZmVmMTY5NiIsImxvZ2luIjoiYWRtaW4iLCJpYXQiOjE2MjYwMDgyMTJ9.lugx_4bjwAfHDjFFvnzMZaOl95qPLHGBEtzEx3vd0I4'